Tekla Open API Reference for Tekla Structures 2025
LoopEnumerator.Current Property
 Returns the current loop.
 Namespace: Tekla.Structures.Solid
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Loop Current { get; }
Public ReadOnly Property Current As Loop
	Get
Property Value
Type: Loop
See Also
Reference
LoopEnumerator Class
Tekla.Structures.Solid Namespace